Repository: jarabt/The-Debian-Administrator-s-Handbook
Catalog: 00a_preface.po
Languages: cs_cz

source: Preface
cs_cz: Úvodní slovo

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to milions of users around the world... and its orbit!
cs_cz: Debian je velmi úspěšný operační systém, který prostupuje našimi digitálními životy mnohem víc, než si dokážeme představit, nebo než si uvědomujeme. Osvětlím to na několika příkladech. V době psaní této příručky je Debian nejpopulárnější GNU/Linux variantou mezi webovými servery: podle < ulink url = "http://w3techs.com/" > W3Techs </ulink>, více než 10% webů běží na Debianu. Zamyslete se nad tím: o kolik webových stránek by jste dnes přišli nebýt Debianu? Co se týče těch více fascinujících uplatnění, Debian byl vybrán jako operační systém pro Mezinárodní vesmírnou stanici (ISS). Sledujete práci astronautů na ISS, snad díky přítomnosti NASA, nebo jiných mezinárodních organizací na sociálních sítích? Jak samotná práce, tak i příspěvky o ní byly umožněny díky Debianu. Bezpočet společností, univerzit a veřejných správ na Debian spoléhá denně při svém provozu, poskytujíc služby milionům uživatelů po celé zeměkouli... i na oběžné dráze!

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us — and Debian is used in all of the above scenarios; you should control it. People without in-depth software knowledge should enjoy those freedoms too: they should be able to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
cs_cz: Ale Debian je mnohem více než jen operační systém, bez ohledu na to, jak složitý, bohatý, a spolehlivý by takový systém mohl být. Debian je vizí svobody kterou lidé požívají ve světě, v němž stále více a více našich každodenních aktivit závisí na softwaru. Debian se zrodil ze základní myšlenky Svobodného Softwaru, tj. že by lidé měli mít své počítače pod kontrolou, a ne naopak. Lidé s dostatečnou znalostí softwaru by měli být schopni rozebrat, modifikovat, znovu sestavit a sdílet s ostatními veškerý software, který je pro ně důležitý. Nezáleží na tom, zda je software používán třeba jen pro rozpustilé činnosti, jako je sdílení obrázků koťat na webu, nebo pro potenciálně život ohrožující úkoly, jako je řízení našich vozů nebo napájení zdravotnických zařízení, které nás léčí - a Debian je používán ve všech výše uvedených případech; měli byste jej dokázat ovládat. Lidé bez hlubších znalostí softwaru by měli tyto svobody také požívat: měli by být schopni delegovat revizi, nebo modifikaci softwarových zařízení na lidi podle svého výběru, na lidi kterým důvěřují.

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
cs_cz: V úsilí o kontrolu lidí nad stroji, svobodné operační systémy hrají zásadní roli: nemůžete mít plnou kontrolu nad počítačovým zařízením, pokud neovládáte jeho operační systém. To je místo, ze kterého vychází hlavní ambice Debianu: produkovat nejlepší, zcela svobodný operační systém. Po více než 20 let Debian vyvíjí jak svobodný operační systém a tak podporuje vizi svobodného softwaru kolem něj. V této činnosti nastavil Debian velmi vysokou laťku pro stoupence svobodného softwaru po celém světě. Například rozhodnutí Debianu v otázkách softwarových licencí, pravidelně sledují mezinárodní standardizační organizace, vlády a jiné projekty svobodného software, při rozhodování, zda by něco mělo být považováno za “dostatečně svobodné”, nebo ne.

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pack on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues... not to mention software packaging and development! Debian contributors take care of all of these.
cs_cz: Tato politická vize však úplně nestačí k vysvětlení jedinečnosti Debianu. Debian je také velmi svérázný společenský experiment, pevně spojený s jeho nezávislostí. Přemýšlejte chvíli o ostatních mainstreamových distribucích svobodného softwaru, nebo dokonce o oblíbených <emphasis> proprietárních </emphasis> operačních systémech. Je pravděpodobné, že můžete spojit každý z nich s velkou společností, která je buď hlavní vývojovou sílou stojící za projektem, nebo přinejmenším správcem všech jeho nevývojových aktivit. Debian je jiný. V rámci projektu Debian si dobrovolníci berou na sebe odpovědnost za veškeré aktivity, které jsou potřebné k udržení Debianu při životě a prosazení se. Rozmanitost těchto činností je ohromující: od překladů až po administraci systému, od marketingu po management, od pořádání konferencí po výtvarné návrhy, od účetnictví po řešení právních otázek... nemluvě o balíkování softwaru a jeho vývoji! Tohle všechno mají přispěvatelé Debianu na starosti.

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
cs_cz: Jako první důsledek této radikální formy nezávislosti je, že Debian potřebuje a spoléhá na velmi různorodou komunitu dobrovolníků. Jakékoli dovednosti z kterékoli z výše uvedených oblastí, nebo z jiných, které si dokážete představit, mohou být investovány do Debianu a budou použity k vylepšení projektu. Druhým důsledkem nezávislosti Debianu je to, že volby Debianu mohou být důvěryhodné, protože nejsou vynucovány obchodními zájmy konkrétních společností - zájmy, u kterých nemáme žádnou záruku, že budou vždy sladěny s cílem podpořit kontrolu lidí nad stroji, což až příliš mnoho příkladů technologických novinek z poslední doby potvrzuje.

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly distributed. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
cs_cz: Také poslední aspekt přispívá k jedinečnosti Debianu: způsob, jakým je tento sociální experiment provozován. Navzdory folkloru, že je to byrokratické, rozhodování v Debianu je ve skutečnosti ve vysoké míře přerozděleno. V rámci projektu existují jasně vymezené oblasti odpovědnosti. Zodpovědní lidé za tyto oblasti mají v řízení volnou ruku. Dokud budou dodržovat požadavky na kvalitu odsouhlasené v rámci společenství, nikdo jim nemůže říct, co mají dělat, nebo jak dělat svou práci. Pokud chcete mít své slovo v dění Debianu, pusťte se do toho a buďte připraveni vzít práci na svá bedra. Tato zvláštní forma meritokracie - kterou někdy nazýváme <emphasis> do-ocracy </emphasis> - velmi posiluje přispěvatele. Každý, kdo má dostatek dovedností, času a motivace může mít reálný vliv na směřování projektu. To dokládá populace čítající přibližně 1 000 oficiálních členů projektu Debian, a několik tisíc přispěvatelů po celém světě. Není divu, že Debian je často uznáván za největší existující komunitou-řízený projekt svobodného softwaru.

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
cs_cz: Takže Debian je zcela unikátní. Jsme jediní, kdo si toho všiml? To rozhodně ne. Podle < ulink url = "http://distrowatch.com/" > DistroWatch </ulink> je kolem 300 aktivních svobodných softwarových distribucí. Polovina z nich (asi 140) jsou debianovské <emphasis> deriváty </emphasis>. To znamená, že začnou Debianem, přizpůsobí jej potřebám svých uživatelů – obvykle přidáním, úpravou a přestavbou balíků – a vydáním výsledného produktu. Deriváty v podstatě uplatňují svobody garantované svobodným softwarem k pozměnění a redistribuci kopií nejen jednotlivých částí softwaru, ale i distribuce jako celku. Potenciál oslovit nové uživatele svobodného softwaru a přispěvatele prostřednictvím derivátových distribucí je obrovský. Věříme, že to je především díky tomuto prospívajícímu ekosystému, že svobodný software dnes konečně soupeří s proprietárním softwarem v oblastech, které byly historicky považovány za těžké dobyvatelné, jako jsou velké desktopové deploymenty. Debian sídlí v jádru největšího žijícího ekosystému svobodných distribucí softwaru: i když nepoužíváte Debian přímo, a i když vám to váš distributor neřekl, je pravděpodobné, že právě teď těžíte z práce komunity Debianu.

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author's/publisher's reputation.
cs_cz: Ale jedinečnost Debianu někdy přináší neočekávané souvislosti. Z důvodu vize Debianu o digitálních svobodách bylo potřeba předefinovat, co máme na mysli, <emphasis> softwarem </emphasis>. Projekt Debian si už dávno uvědomil, že jako součást operačního systému potřebujete distribuovat spoustu nesoftwarového materiálu: hudbu, obrázky, dokumentaci, zdrojová data, firmware atd. Ale jak uplatníte <emphasis> softwarové </emphasis> svobody na tento materiál? Měli bychom mít rozdílné požadavky, nebo by měl všechen vydaný materiál podléhat stejně vysokému standardu svobody? Projekt Debian se rozhodl pro to druhé: veškerý materiál dodaný jako součást Debianu by měl svým uživatelům nabízet stejné svobody. Taková radikální filosofická pozice má dalekosáhlé dopady. To znamená, že nemůžeme distribuovat nesvobodný firmware, nebo uměleckou práci, která není určená pro komerční využití, nebo knihy, které nemohou být změněny, aby se zabránilo újmě (jak knižní vydavatelé často říkají) na pověsti autora/vydavatele.

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspect of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that there was little reading material that helped to spread Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that others in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
cs_cz: Kniha, kterou držíte v rukou, je jiná. Je to <emphasis>čistě svobodná</emphasis> kniha, která podléhá standardům svobody Debianu pro každý z aspektů vašeho digitálního života. Po velmi dlouhou dobu, malá dostupnost knih, jako je tato, byla významným nedostatkem Debianu. To znamenalo, že tu bylo ke čtení málo materiálu, který by pomáhal šířit Debian a jeho hodnoty, a zároveň ztělesňoval tyto hodnoty a předváděl jejich výhody. To ale také ironicky znamenalo, že jsme měli málo takových materiálů, které bychom mohli distribuovat jako součást samotného Debianu. Toto je první seriózní kniha, která řeší tento nedostatek. Můžete použít <command>apt install</command> k získání této knihy, můžete ji šířit, můžete větvit tuto knihu, nebo lépe, hlásit chyby a opravovat je, aby ostatní mohli v budoucnu těžit z vašich příspěvků. “Správci” této knihy, kteří jsou zároveň i jejími autory, jsou dlouholetými členy projektu Debian, kteří rozumí ethosu svobody, který prostupuje každým aspektem Debianu a vědí z první ruky, co znamená převzít odpovědnost za důležité části Debianu. Vydáním této knihy dělají, ještě jednou, vynikající služby pro komunitu Debianu.

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
cs_cz: Doufáme, že si užijete tento základní kámen Debianu stejně jako my.

source: October 2015
cs_cz: Říjen 2015

source: Stefano Zacchiroli (Debian Project Leader 2010-2013), Lucas Nussbaum (Debian Project Leader 2013-2015) and Neil McGovern (Debian Project Leader 2015-incumbent)
cs_cz: Stefano Zacchiroli (vedoucí projektu Debian 2010-2013), Lucas Nussbaum (vedoucí projektu Debian 2013-2015) and Neil McGovern (vedoucí projetku Debian 2015-současnost)
