Repository: jarabt/The-Debian-Administrator-s-Handbook
Catalog: 00b_foreword.po
Languages: cs_cz

source: Foreword
cs_cz: Předmluva

source: Linux has been garnering strength for a number of years now, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
cs_cz: Linux nabíral sílu pro řadu let, a jeho rostoucí popularita přiměla více a více uživatelů, aby učinili tento skok. Prvním krokem na této cestě je vybrat distribuci. To je důležité rozhodnutí, protože každá distribuce má své vlastní zvláštnosti, a budoucím nákladům na migraci se lze vyhnout, pokud je učiněna správná volba již od začátku.

source: <emphasis>BACK TO BASICS</emphasis> Linux distribution, Linux kernel
cs_cz: <emphasis> zpět k ZÁKLADům </emphasis> Linuxová distribuce, linuxové jádro

source: <primary>Linux</primary><secondary>kernel</secondary>
cs_cz: <primary> Linux </primary> <secondary> jádra </secondary>

source: <primary>Linux</primary><secondary>distribution</secondary>
cs_cz: <primary> Linux </primary> <secondary> distribuce </secondary>

source: <primary>distribution</primary><secondary>Linux distribution</secondary>
cs_cz: <primary> distribuce </primary> <secondary> Linux distribuce </secondary>

source: Strictly speaking, Linux is only a kernel, the core piece of software which sits between the hardware and the applications.
cs_cz: Striktně vzato, Linux je pouze jádro, jádro kus software, který sedí mezi hardwarem a aplikací.

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into a tool that is actually useful.
cs_cz: "Linuxová distribuce" je plný operační systém; To obvykle zahrnuje linuxové jádro, instalační program, a co je nejdůležitější aplikace a další software potřebné k proměnit počítač na nástroj, který je skutečně užitečná.

source: Debian GNU/Linux is a “generic” Linux distribution that fits most users. The purpose of this book is to show its many aspects so that you can make an informed decision when choosing.
cs_cz: Debian GNU/Linux je "generická" linuxová distribuce, která se hodí pro většinu uživatelů. Účelem této knihy je Ukázat své mnoho aspektů, takže můžete učinit informované rozhodnutí při výběru.

source: Why This Book?
cs_cz: Proč tahle kniha?

source: <emphasis>CULTURE</emphasis> Commercial distributions
cs_cz: <emphasis> kultura </emphasis> Komerční distribuce

source: <primary>distribution</primary><secondary>commercial distribution</secondary>
cs_cz: <primary> distribuce </primary> <secondary> komerční distribuce </secondary>

source: Most Linux distributions are backed by a for-profit company that develops them and sells them under some kind of commercial scheme. Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
cs_cz: Většina linuxových distribucí jsou zálohovány pro-ziskové společnosti, která je vyvíjí a prodává pod nějakým druhem komerčního systému. Příklady zahrnují <emphasis> Ubuntu </emphasis>, vyvinutý především společností <emphasis> Canonical Ltd. </emphasis>; <emphasis> Mandriva Linux </emphasis>, francouzská společnost <emphasis> Mandriva SA </emphasis>; a <emphasis> SUSE Linux </emphasis>, udržovaný a komerčně dostupný firmou <emphasis> Novell </emphasis>.

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet. While some of them do work on Debian as part of their paid job in various companies, the project as a whole is not attached to any company in particular, nor does any one company have a greater say in the project's affairs than what purely volunteer contributors have.
cs_cz: Na druhém konci spektra leží likes Debianu a Apache Software Foundation (který hostuje vývoj pro webový server Apache). Debian je především projekt ve světě svobodného softwaru, implementovaný dobrovolníky, kteří spolupracují prostřednictvím Internetu. Zatímco někteří z nich pracují na Debianu jako součást své placené práce v různých společnostech, projekt jako celek není nijak zvlášť spojen s žádnou společností, ani nemá žádnou společnost větší slovo v záležitostech projektu než to, co mají ryze dobrovolní přispěvatelé.

source: Linux has gathered a fair amount of media coverage over the years; it mostly benefits the distributions supported by a real marketing department — in other words, company-backed distributions (Ubuntu, Red Hat, SUSE, Mandriva, and so on). But Debian is far from being a marginal distribution; multiple studies have shown over the years that it is widely used both on servers and on desktops. This is particularly true among webservers where Debian is the leading Linux distribution. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
cs_cz: Linux se těšil v průběhu let slušnému množství mediální pozornosti; to hlavně přináší prspěch distribucím podporovaných skutečnými marketingovými odděleními -jinými slovy, společnostmi zabezpečeným distribucím (Ubuntu, Red Hat, SUSE, Mandriva, a tak dále). Ale Debian zdaleka není jen okrajová distribuce; v průběhu let mnoho studií ukázalo, že je široce používán jak na serverech, tak na stolních počítačích. To platí zejména u webserverů, kde je Debian přední linuxová distribuce. < ulink typ = "block" url = "http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html"/> < ulink typ = "block" url = "http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos"/>

source: The purpose of this book is to help you discover this distribution. We hope to share the experience that we have gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you will join us sometime…
cs_cz: Účelem této knihy je pomoci vám objevi tuto distribuci. Rádi bychom sdíleli zkušenosti, které jsme nashromáždili od doby, kdy jsme se připojili k projektu jako vývojáři a přispěvatelé v 1998 (Raphaël) a 2000 (Roland). S trochou štěstí bude naše nadšení nakažlivé a možná se k nám někdy připojíte...

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and over the years the situation slipped back to one where there were very few good books on Debian. We hope that this book, which has started a new life with its translation into English (and several translations from English into various other languages), will fill this gap and help many users.
cs_cz: První vydání této knihy (v roce 2004) sloužilo k vyplnění mezery: byla to první kniha ve francouzském jazyce, která se zaměřila výhradně na Debian. V té době, mnoho dalších knih bylo napsáno na toto téma jak pro francouzsky mluvící, tak i pro anglicky mluvící čtenáře. Bohužel téměř žádné z nich se nedostávalo aktualizací, a v průběhu let situace sklouzla zpět do pozice, kdy bylo o Debianu jen velmi málo dobrých knih. Doufáme, že tato kniha, která začala svůj nový život překladem do angličtiny (a několika překlady z angličtiny do různých jiných jazyků), zaplní tuto mezeru a pomůže mnoha uživatelům.

source: Who Is this Book For?
cs_cz: Pro koho je tato kniha?

source: We tried to make this book useful for many categories of readers. First, systems administrators (both beginners and experienced) will find explanations about the installation and deployment of Debian on many computers. They will also get a glimpse of most of the services available on Debian, along with matching configuration instructions and a description of the specifics coming from the distribution. Understanding the mechanisms involved in Debian's development will enable them to deal with unforeseen problems, knowing that they can always find help within the community.
cs_cz: Snažili jsme se, aby tato kniha užitečná pro mnoho kategorií čtenářů. ZaPrvé, správci systémů (Začátečníci i zkušení) najdou vysvětlení o instalaci a nasazení Debianu na mnoha počítačích. Budou také mít přehled o většině služeb, které jsou k dispozici na Debian, spolu s odpovídajícími konfiguračními pokyny a popis specifik pocházejících z distribuce. Pochopení mechanismů, které se podílejí na vývoji Debianu, jim umožní vypořádat se s nepředvídanými problémy, protože vědí, že mohou vždy najít pomoc v rámci komunity.

source: Users of another Linux distribution, or of another Unix variant, will discover the specifics of Debian, and should become operational very quickly while benefiting fully from the unique advantages of this distribution.
cs_cz: Uživatelé jiné linuxové distribuce nebo jiné varianty Unixu budou objevovat specifika Debianu a měli by být velmi rychle v provozu a zároveň plně těžit z jedinečných výhod této distribuce.

source: Finally, readers who already have some knowledge of Debian and want to know more about the community behind it should see their expectations fulfilled. This book should make them much closer to joining us as contributors.
cs_cz: A konečně, čtenáři, kteří již mají nějaké znalosti o Debianu a chcete se dozvědět více o komunitě za ním by mělo vidět jejich očekávání splněna. Tato kniha by měla být mnohem blíž k nám jako přispěvatelé.

source: General Approach
cs_cz: Obecný přístup

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the “Debian way” of doing things.
cs_cz: Veškerá obecná dokumentace, kterou o GNU/Linuxu najdete, se vztahuje i na Debian, protože Debian obsahuje většinu běžného svobodného softwaru. Nicméně, distribuce přináší mnoho vylepšení, což je důvod, proč jsme se rozhodli především popsat "Debian způsobem" dělat věci.

source: It is interesting to follow the Debian recommendations, but it is even better to understand their rationale. Therefore, we won't restrict ourselves to practical explanations only; we will also describe the project's workings, so as to provide you with comprehensive and consistent knowledge.
cs_cz: Je zajímavé sledovat Debian doporučení, ale je ještě lepší pochopit jejich zdůvodnění. Proto se nebudeme omezovat pouze na praktická vysvětlení; Budeme také popisovat práci projektu, abychom vám poskytli komplexní a konzistentní znalosti.

source: Book Structure
cs_cz: Knižní struktura

source: This book has its origins in French publisher Eyrolles' “Administrator's Handbook” collection, and keeps the same approach of revolving around a case study providing both support and illustration for all topics being addressed.
cs_cz: Tato kniha má svůj původ ve francouzském nakladatelství Eyrolles ' "Administrator příručka" kolekce, a udržuje stejný přístup otáčivé kolem případové studie poskytující jak podporu a ilustrace pro všechna témata jsou řešeny.

source: <emphasis>NOTE</emphasis> Web site, authors' email
cs_cz: <emphasis>Poznámka:</emphasis> Webové stránky, autory ' email

source: This book has its own website, which hosts whatever elements that can make it more useful. In particular, it includes an online version of the book with clickable links, and possible errata. Feel free to browse it and to leave us some feedback. We will be happy to read your comments or support messages. Send them by email to <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
cs_cz: Tato kniha má své vlastní webové stránky, které hostí bez ohledu na prvky, které mohou dělat to užitečnější. Zejména obsahuje online verzi knihy s odkazy na kliknutí a případné chyby. Neváhejte a prohlížet a nechat nám nějakou zpětnou vazbu. Rádi si přečteme Vaše komentáře nebo podpůrné zprávy. Pošlete je e-mailem na <email>hertzog@debian.org</email> (Raphaël) a <email>lolando@debian.org</email> (Roland).<ulink type=""block"" url=""http://debian-handbook.info/""></ulink>

source: <emphasis role="strong">Chapter 1</emphasis> focuses on a non-technical presentation of the Debian project and describes its goals and organization. These aspects are important because they define a general framework that other chapters will complete with more concrete information.
cs_cz: <emphasis role=""strong"">Kapitola 1</emphasis> se zaměřuje na netechnickou prezentaci projektu Debian a popisuje její cíle a organizaci. Tyto aspekty jsou důležité, protože definují obecný rámec, který další kapitoly doplní konkrétnější informace.

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they will find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
cs_cz: <emphasis role=""strong"">Kapitoly 2 a 3</emphasis> poskytují široký nástin případové studie. V tomto bodě, začínající čtenáři mohou mít čas na čtení <emphasis role=""strong"">dodatku B</emphasis>, kde se najde krátký nápravný kurz vysvětlující řadu základních počítačových pojmů, stejně jako pojmy vlastní jakýkoli Unixový systém.

source: To get on with our real subject matter, we will quite naturally start with the installation process (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> will unveil basic tools that any Debian administrator will use, such as those of the <emphasis role="strong">APT</emphasis> family, which is largely responsible for the distribution's excellent reputation. These chapters are in no way restricted to professionals, since everyone is their own administrator at home.
cs_cz: Abychom se dostali na naše skutečné téma, budeme zcela přirozeně začít s procesem instalace (<emphasis role=""strong"">Kapitola 4</emphasis>); <emphasis role=""strong"">kapitoly 5 a 6</emphasis> představí základní nástroje, které bude používat každý správce Debianu, jako jsou ty z rodiny <emphasis role=""strong"">apt</emphasis> , která je z velké části zodpovědná za vynikající reputaci distribuce. Tyto kapitoly nejsou nijak omezeny na profesionály, protože každý je jejich vlastní správce doma.

source: <emphasis role="strong">Chapter 7</emphasis> will be an important parenthesis; it describes workflows to efficiently use documentation and to quickly gain an understanding of problems in order to solve them.
cs_cz: <emphasis role=""strong"">Kapitola 7</emphasis> bude důležitá závorka; Popisuje pracovní postupy efektivně používat dokumentaci a rychle získat pochopení problémů, aby je vyřešit.

source: The next chapters will be a more detailed tour of the system, starting with basic infrastructure and services (<emphasis role="strong">chapters 8 to 10</emphasis>) and going progressively up the stack to reach the user applications in <emphasis role="strong">chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> deals with more advanced subjects that will most directly concern administrators of large sets of computers (including servers), while <emphasis role="strong">chapter 14</emphasis> is a brief introduction to the wider subject of computer security and gives a few keys to avoid most problems.
cs_cz: V následujících kapitolách bude podrobnější prohlídka systému počínaje základní infrastrukturou a službami (<emphasis role=""strong"">kapitoly 8 až 10</emphasis>) a postupně se zásobníkem dosáhnete uživatelských aplikací v <emphasis role=""strong"">kapitole 13</emphasis>. <emphasis role=""strong"">Kapitola 12</emphasis> se zabývá pokročilejšími předměty, které se nejvíce přímo týkají správců velkých souborů počítačů (včetně serverů), zatímco <emphasis role=""strong"">Kapitola 14</emphasis> je stručný úvod do širšího předmětu počítačové bezpečnosti a dává několik klíčů k Vyhněte se většině problémů.

source: <emphasis role="strong">Chapter 15</emphasis> is for administrators who want to go further and create their own Debian packages.
cs_cz: <emphasis role=""strong"">Kapitola 15</emphasis> je pro administrátory, kteří chtějí jít dál a vytvořit si vlastní debianí balíčky.

source: <emphasis>VOCABULARY</emphasis> Debian package
cs_cz: <emphasis>Slovní zásoba</emphasis> Balíček Debianu

source: <primary>package</primary><secondary>Debian package</secondary>
cs_cz: <primary>balíček</primary> <secondary>Balíček Debianu</secondary>

source: <primary>package</primary><secondary>binary package</secondary>
cs_cz: <primary>balíček</primary> <secondary>binární balíček</secondary>

source: <primary>package</primary><secondary>source package</secondary>
cs_cz: <primary>balíček</primary> <secondary>zdrojový balíček</secondary>

source: <primary>source</primary><secondary>package</secondary>
cs_cz: <primary>zdroj</primary> <secondary>balíček</secondary>

source: A Debian package is an archive containing all the files required to install a piece of software. It is generally a file with a <filename>.deb</filename> extension, and it can be handled with the <command>dpkg</command> command. Also called a <emphasis>binary package</emphasis>, it contains files that can be directly used (such as programs or documentation). On the other hand, a <emphasis>source package</emphasis> contains the source code for the software and the instructions required for building the binary package.
cs_cz: Balíček Debianu je archiv obsahující všechny soubory potřebné k instalaci softwaru. Jedná se obvykle o soubor s příponou <filename>deb</filename> , který lze zpracovat příkazem <command>dpkg</command> . Také nazývaný <emphasis>binární balíček</emphasis>obsahuje soubory, které lze přímo použít (například programy nebo dokumentace). Na druhou stranu <emphasis>zdrojový balíček</emphasis> obsahuje zdrojový kód pro software a pokyny potřebné pro sestavení binárního balíčku.

source: The present version is already the seventh edition of the book (we include the first four that were only available in French). This edition covers version 8 of Debian, code-named <emphasis role="distribution">Jessie</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>arm64</emphasis> for 64-bit ARM processors, and <emphasis>ppc64el</emphasis> for little-endian 64-bit PowerPC processors (designed by IBM and licensed to various manufacturers via the OpenPOWER foundation). On the opposite side, some architectures have been dropped (<emphasis>sparc</emphasis>, <emphasis>ia64</emphasis>) due to lack of volunteers to keep up with development (which itself can be explained by the fact that associated hardware is getting old and less interesting to work on). Some architectures are still available (in the <emphasis role="distribution">Unstable</emphasis> distribution) but did not get their <emphasis>ready for release</emphasis> stamp: <emphasis>hurd-i386</emphasis>, <emphasis>kfreebsd-i386</emphasis>, <emphasis>kfreebsd-amd64</emphasis>. All included packages have obviously been updated, including the GNOME desktop, which is now in its version 3.14. More interestingly, there are two new alternative desktops that are available: <ulink url="http://cinnamon.linuxmint.com/">Cinnamon</ulink> (fork of GNOME's Shell created by and for Linux Mint) and <ulink url="http://mate-desktop.org/">MATE</ulink> (continuation of the GNOME 2.x desktop).
cs_cz: Současná verze je již sedmé vydání knihy (patříme první čtyři, které byly k dispozici pouze ve francouzštině). Toto vydání zahrnuje verzi 8 Debianu s kódovým názvem <emphasis role=""distribution"">Jessie</emphasis>. Mezi tyto změny, Debian nyní sportovní dvě nové architektury- <emphasis>arm64</emphasis> pro 64-bit ARM procesory, a <emphasis>ppc64el</emphasis> pro little-endian 64-bit PowerPC procesorů (navržený IBM a licencované pro různé výrobce prostřednictvím OpenPOWER Foundation). Na opačné straně, některé architektury byly vynechány (<emphasis>SPARC</emphasis>, <emphasis>ia64</emphasis>) kvůli nedostatku dobrovolníků držet s vývojem (což samo o sobě lze vysvětlit tím, že související hardware je stále staré a méně zajímavé pracovat na). Některé architektury jsou stále k dispozici (v <emphasis role=""distribution"">nestabilní</emphasis> distribuci), ale nedostal jejich <emphasis>připravený k uvolnění</emphasis> razítko: <emphasis>Hurd-i386</emphasis>, <emphasis>kFreeBSD-i386</emphasis>, <emphasis>kFreeBSD-amd64</emphasis>. Všechny zahrnuté balíčky byly samozřejmě aktualizovány, včetně GNOME Desktop, který je nyní ve verzi 3,14. Zajímavější je, že existují dvě nové alternativní desktopy, které jsou k dispozici: <ulink url=""http://cinnamon.linuxmint.com/"">skořice</ulink> (vidlička GNOME Shell vytvořil a pro Linux Mint) a <ulink url=""http://mate-desktop.org/"">mate</ulink> (pokračování GNOME 2. x Desktop).

source: We have added some notes and remarks in sidebars. They have a variety of roles: they can draw attention to a difficult point, complete a notion of the case study, define some terms, or serve as reminders. Here is a list of the most common of these sidebars:
cs_cz: Přidali jsme některé poznámky a poznámky v postranní. Mají různé role: mohou upozornit na obtížný bod, dokončit pojem případové studie, definovat některé termíny, nebo sloužit jako připomenutí. Zde je seznam nejběžnějších těchto sidebars:

source: BACK TO BASICS: a reminder of some information that is supposed to be known;
cs_cz: ZPĚT k ZÁKLADům: připomínka některých informací, které mají být známy;

source: VOCABULARY: defines a technical term, sometimes Debian specific;
cs_cz: SLOVNÍ ZÁSOBa: definuje technický termín, někdy specifické pro Debian;

source: COMMUNITY: highlights important persons or roles within the project;
cs_cz: Společenství: poukazuje na důležité osoby nebo role v rámci projektu;

source: POLICY: a rule or recommendation from the Debian Policy. This document is essential within the project, and describes how to package software. The parts of the policy highlighted in this book bring direct benefits to users (for example, knowing that the policy standardizes the location of documentation and examples makes it easy to find them even in a new package).
cs_cz: ZÁSADA: pravidlo nebo doporučení ze zásady Debianu. Tento dokument je nezbytný v rámci projektu a popisuje, jak balíček softwaru. Části zásady zvýrazněné v této příručce přináší uživatelům přímé výhody (například s vědomím, že zásady standardizovat umístění dokumentace a příklady usnadňuje najít i v novém balíčku).

source: TOOL: presents a relevant tool or service;
cs_cz: Nástroj: představuje příslušný nástroj nebo službu;

source: IN PRACTICE: theory and practice do not always match; these sidebars contain advice resulting from our experience. They can also give detailed and concrete examples;
cs_cz: V praxi: teorie a praxe nemusí vždy odpovídat; Tyto postranní obsahují Rady vyplývající z našich zkušeností. Mohou také poskytnout podrobné a konkrétní příklady;
