Repository: jarabt/The-Debian-Administrator-s-Handbook
Catalog: 00b_foreword.po
Languages: cs_cz

source: other more or less frequent sidebars are rather explicit: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
cs_cz: ostatní více či méně časté postranní jsou spíše explicitní: kultura, TIP, opatrnost, jít dál, bezpečnost, a tak dále.

source: Acknowledgments
cs_cz: Potvrzování

source: A Bit of History
cs_cz: Trocha historie

source: In 2003, Nat Makarévitch contacted Raphaël because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. Raphaël immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
cs_cz: V 2003, NAT Makarévitch kontaktoval Raphaël, protože chtěl zveřejnit knihu o Debianu v <foreignphrase>Cahier de l'Admin</foreignphrase> (admin Handbook) kolekce, že on byl řídící pro Eyrolles, přední francouzský Editor technických knih. Raphaël okamžitě přijal napsat. První vydání vyšlo na 14 říjnu 2004 a byl obrovský úspěch-to bylo vyprodáno sotva čtyři měsíce později.

source: Since then, we have released 6 other editions of the French book, one for each subsequent Debian release. Roland, who started working on the book as a proofreader, gradually became its co-author.
cs_cz: Od té doby jsme vydali 6 dalších vydání francouzské knihy, jednu pro každé další vydání Debianu. Roland, který začal pracovat na knize jako korektor, se postupně stal jeho co-autorem.

source: While we were obviously satisfied with the book's success, we always hoped that Eyrolles would convince an international editor to translate it into English. We had received numerous comments explaining how the book helped people to get started with Debian, and we were keen to have the book benefit more people in the same way.
cs_cz: I když jsme byli zjevně spokojeni s úspěchem knihy, vždy jsme doufali, že Eyrolles přesvědčí mezinárodní editor, aby jej přeložil do angličtiny. Obdrželi jsme četné komentáře vysvětlující, jak Kniha pomohla lidem začít s Debianem, a my jsme chtěli mít knihu prospěch více lidí stejným způsobem.

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we negotiated with our French editor Eyrolles and got back the necessary rights to translate the book into English and publish it ourselves. Thanks to a successful crowdfunding campaign, we worked on the translation between December 2011 and May 2012. The “Debian Administrator's Handbook” was born and it was published under a free-software license!
cs_cz: Bohužel, žádný anglicky mluvící redaktor, kterého jsme kontaktovali, byl ochoten riskovat překládání a publikování knihy. Ne odkládal tento malý nezdar, jsme jednali s naší francouzské Editor Eyrolles a dostal zpět nezbytná práva přeložit knihu do angličtiny a publikovat sami. Díky úspěšné crowdfunding kampani jsme pracovali na překladu mezi prosincem 2011 a květen 2012. Zrodila se "Příručka správce Debianu" a byla vydána pod licencí svobodného software!

source: While this was an important milestone, we already knew that the story would be not be over for us until we could contribute the French book as an official translation of the English book. This was not possible at that time because the French book was still distributed commercially under a non-free license by Eyrolles.
cs_cz: I když to byl důležitý milník, už jsme věděli, že příběh by neměl být u konce pro nás, dokud bychom mohli přispět francouzská kniha jako oficiální překlad anglické knihy. To nebylo možné v té době, protože francouzská kniha byla stále distribuována komerčně pod non-svobodné licence od Eyrolles.

source: In 2013, the release of Debian 7 gave us a good opportunity to discuss a new contract with Eyrolles. We convinced them that a license more in line with the Debian values would contribute to the book's success. That wasn't an easy deal to make, and we agreed to setup another crowdfunding campaign to cover some of the costs and reduce the risks involved. The operation was again a huge success and in July 2013, we added a French translation to the Debian Administrator's Handbook.
cs_cz: V 2013, uvolnění Debian 7 nám dal dobrou příležitost diskutovat o nové smlouvy s Eyrolles. Přesvědčili jsme je, že licence více v souladu s hodnotami Debianu by přispěla k úspěchu knihy. To nebylo snadné dělat, a my jsme souhlasili s nastavením další Crowdfunding kampaň na pokrytí některých nákladů a snížit rizika spojená. Operace byla opět velkým úspěchem a v červenci 2013 jsme přidali francouzský překlad do příručky pro administrátory Debianu.

source: The Birth of the English Book
cs_cz: Proč tahle kniha?

source: We are back in 2011 and we just got the required rights to make an English translation of our French book. We are looking into ways to make this happen.
cs_cz: Jsme zpátky v 2011 a my jsme právě dostali požadovaná práva, aby se anglický překlad naší francouzské knihy. Hledáme způsoby, jak se to stane.

source: Translating a book of 450 pages is a considerable effort that requires several months of work. Self-employed people like us had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowdfunding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
cs_cz: Překlad knihy 450 stránek je značné úsilí, které vyžaduje několik měsíců práce. Osoby samostatně výdělečně činné, jako jsme my, musely zajistit minimální příjem mobilizovat čas potřebný k dokončení projektu. Tak jsme se zřídit Crowdfunding kampaň na Ulule a požádal lidi, aby zástava peníze na projekt.<ulink type=""block"" url=""http://www.ulule.com/debian-handbook/""></ulink>

source: The campaign had two goals: raising €15,000 for the translation and completing a €25,000 liberation fund to get the resulting book published under a free license — that is, a license that fully follows the Debian Free Software Guidelines.
cs_cz: Kampaň měla dva cíle: zvyšování €15 000 za překlad a dokončení €25 000 osvobození fondu získat výslednou knihu publikoval pod bezplatnou licenci-to je licence, která plně dodržuje Debian Free software pokyny.

source: When the Ulule campaign ended, the first goal had been achieved with €24,345 raised. The liberation fund was not complete however, with only €14,935 raised. As initially announced, the liberation campaign continued independently from Ulule on the book's official website.
cs_cz: Když Ulule kampaň skončila, první gól bylo dosaženo s €24 345 zvednutý. Osvobození fond nebyl kompletní však pouze €14 935 vzneseny. Jak bylo původně oznámeno, osvobození kampaň pokračoval nezávisle na Ulule na oficiálních stránkách knihy.
